ErichStyger/mcuoneclipse/Examples/MCUXpresso/tinyK22/tinyK22_Bootloader/source/property/src/property_kinetis.c
#if BL_HAS_SECONDARY_INTERNAL_FLASH
        g_bootloaderContext.flashDriverInterface->flash_get_property(g_bootloaderContext.allFlashState,
                                                                     kFLASH_PropertyPflash1BlockBaseAddr,
                                                                     &propertyStore->flashStartAddress[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(g_bootloaderContext.allFlashState,
                                                                     kFLASH_PropertyPflash1TotalSize,
                                                                     &propertyStore->flashSizeInBytes[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(g_bootloaderContext.allFlashState,
                                                                     kFLASH_PropertyPflash1SectorSize,
                                                                     &propertyStore->flashSectorSize[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(g_bootloaderContext.allFlashState,
                                                                     kFLASH_PropertyPflash1BlockSize,
                                                                     &propertyStore->flashBlockSize[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(g_bootloaderContext.allFlashState,
                                                                     kFLASH_PropertyPflash1BlockCount,
                                                                     &propertyStore->flashBlockCount[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(g_bootloaderContext.allFlashState,
                                                                     kFLASH_PropertyPflash1FacSupport,
                                                                     &propertyStore->flashFacSupport[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(g_bootloaderContext.allFlashState,
                                                                     kFLASH_PropertyPflash1AccessSegmentSize,
                                                                     &propertyStore->flashAccessSegmentSize[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(g_bootloaderContext.allFlashState,
                                                                     kFLASH_PropertyPflash1AccessSegmentCount,
                                                                     &propertyStore->flashAccessSegmentCount[kFlashIndex_Secondary]);
#endif
#if BL_FEATURE_SUPPORT_DFLASH
        if (g_bootloaderContext.dflashDriverInterface != NULL)
        {
            g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
                                                                          kFLEXNVM_PropertyDflashBlockBaseAddr,
                                                                         &propertyStore->flashStartAddress[kFalshIndex_DFlash]);     
            g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
                                                                          kFLEXNVM_PropertyDflashTotalSize,
                                                                         &propertyStore->flashSizeInBytes[kFalshIndex_DFlash]);          
            g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
                                                                          kFLEXNVM_PropertyDflashSectorSize,
                                                                         &propertyStore->flashSectorSize[kFalshIndex_DFlash]);      
            g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
                                                                          kFLEXNVM_PropertyDflashBlockSize,
                                                                         &propertyStore->flashBlockSize[kFalshIndex_DFlash]);                                                                       
            g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
                                                                          kFLEXNVM_PropertyDflashBlockCount,
                                                                         &propertyStore->flashBlockCount[kFalshIndex_DFlash]);  

//        g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
//                                                                      kFLEXNVM_PropertyFlexRamBlockBaseAddr,
//                                                                     &propertyStore->flashSectorSize[kFalshIndex_DFlash]); 
//        g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
//                                                                      kFLEXNVM_PropertyFlexRamTotalSize,
//                                                                     &propertyStore->flashSectorSize[kFalshIndex_DFlash]); 
//        g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
//                                                                      kFLEXNVM_PropertyEepromTotalSize,
//                                                                     &propertyStore->flashSectorSize[kFalshIndex_DFlash]);                 
        }
#endif //  BL_FEATURE_SUPPORT_DFLASH     
    }
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH

    // Fill in reserved regions.
    //! @todo Support other tool chain

    uint32_t flashStart = 0;
    uint32_t flashEnd = 0;
    uint32_t ramStart = 0;
    uint32_t ramEnd = 0;

#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
#if !BL_TARGET_FLASH
    flashStart = (&g_bootloaderContext.memoryMap[kIndexFlashArray])->startAddress;
    flashEnd = (&g_bootloaderContext.memoryMap[kIndexFlashArray])->startAddress;
#else
    flashStart = __ROM_START;
    flashEnd = __ROM_END;
    assert(flashEnd);

    // Force flash erase size alignment.
    // Note: Assume that flash-resident bootloader is always in Main flash.
    flashStart = ALIGN_DOWN(flashStart, propertyStore->flashSectorSize[kFlashIndex_Main]);
    flashEnd = ALIGN_UP(flashEnd, propertyStore->flashSectorSize[kFlashIndex_Main]) - 1;
#endif
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
    ramStart = __RAM_START;
    ramEnd = __RAM_END;
    assert(ramEnd);

    propertyStore->reservedRegions[kProperty_FlashReservedRegionIndex].startAddress = flashStart;
    propertyStore->reservedRegions[kProperty_FlashReservedRegionIndex].endAddress = flashEnd;
    propertyStore->reservedRegions[kProperty_RamReservedRegionIndex].startAddress = ramStart;
    propertyStore->reservedRegions[kProperty_RamReservedRegionIndex].endAddress = ramEnd;

