ErichStyger/mcuoneclipse/Examples/MCUXpresso/tinyK22/tinyK22_Bootloader/source/property/src/property_kinetis.c
    // Fill in available peripherals array.
    const peripheral_descriptor_t *peripherals = g_bootloaderContext.allPeripherals;
    propertyStore->availablePeripherals = 0;
    for (uint32_t i = 0; peripherals[i].typeMask != 0; ++i)
    {
        // Check that the peripheral is enabled in the user configuration data.
        if (propertyStore->configurationData.enabledPeripherals & peripherals[i].typeMask)
        {
            propertyStore->availablePeripherals |= peripherals[i].typeMask;
        }
    }

// Fill in unique device id value.
// Different series have different length of UID (K series=128 bits, KL series=80 bits)
#if (!FSL_FEATURE_SIM_HAS_NO_UID) && defined(SIM)
#if defined(SIM_UIDH) | defined(SIM_UIDH_UID)
#if defined(SIM_UIDM_UID)
    propertyStore->UniqueDeviceId.uid[2] = SIM->UIDH;
#else
    propertyStore->UniqueDeviceId.uid[3] = SIM->UIDH;
#endif
#endif
#if defined(SIM_UIDM_UID)
    propertyStore->UniqueDeviceId.uid[1] = SIM->UIDM;
#else
    propertyStore->UniqueDeviceId.uid[2] = SIM->UIDMH;
    propertyStore->UniqueDeviceId.uid[1] = SIM->UIDML;
#endif // defined(SIM_UIDM)
    propertyStore->UniqueDeviceId.uid[0] = SIM->UIDL;
#endif // #if !FSL_FEATURE_SIM_HAS_NO_UID

    // Set address range of RAM in property interface
    const memory_map_entry_t *map = (memory_map_entry_t *)&g_bootloaderContext.memoryMap[kIndexSRAM];
    propertyStore->ramStartAddress[kPropertyIndex_SRAM] = map->startAddress;
    propertyStore->ramSizeInBytes[kPropertyIndex_SRAM] = map->endAddress - map->startAddress + 1;
#if defined(K28F15_SERIES)
    map = (memory_map_entry_t *)&g_bootloaderContext.memoryMap[kIndexOCRAM];
    propertyStore->ramStartAddress[kPropertyIndex_OCRAM] = map->startAddress;
    propertyStore->ramSizeInBytes[kPropertyIndex_OCRAM] = map->endAddress - map->startAddress + 1;
#elif defined(KV58F24_SERIES)
    map = (memory_map_entry_t *)&g_bootloaderContext.memoryMap[kIndexDTCM];
    propertyStore->ramStartAddress[kPropertyIndex_DTCM] = map->startAddress;
    propertyStore->ramSizeInBytes[kPropertyIndex_DTCM] = map->endAddress - map->startAddress + 1;
    map = (memory_map_entry_t *)&g_bootloaderContext.memoryMap[kIndexOCRAM];
    propertyStore->ramStartAddress[kPropertyIndex_OCRAM] = map->startAddress;
    if (map->startAddress == map->endAddress)
    {
        propertyStore->ramSizeInBytes[kPropertyIndex_OCRAM] = 0;
    }
    else
    {  
        propertyStore->ramSizeInBytes[kPropertyIndex_OCRAM] = map->endAddress - map->startAddress + 1;
    }
#endif // defined(K28F15_SERIES)

#if BL_FEATURE_CRC_CHECK
    // Initialize crc check status property based on BCA related fields.
    init_crc_check_status(propertyStore);
#endif

#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
    // Fill in default margin level.
    propertyStore->flashReadMargin = (uint32_t)kFTFx_MarginValueUser;
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH

#if BL_FEATURE_QSPI_MODULE
    propertyStore->qspiInitStatus = get_qspi_otfad_init_status();
#endif // BL_FEATURE_QSPI_MODULE

    return kStatus_Success;
}

// See property.h for documentation on this function.
status_t bootloader_property_get(uint8_t tag, uint32_t id, const void **value, uint32_t *valueSize)
{
    property_store_t *propertyStore = g_bootloaderContext.propertyInterface->store;

#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
    uint32_t flashIndex = kFlashIndex_Main;
#if BL_HAS_SECONDARY_INTERNAL_FLASH
    if (id < kFLASHCount)
    {
        flashIndex = id;
    }
#endif // BL_HAS_SECONDARY_INTERNAL_FLASH
#if BL_FEATURE_SUPPORT_DFLASH
    if (g_bootloaderContext.dflashDriverInterface != NULL)
    {
        flashIndex = id;
    }
#endif // BL_FEATURE_SUPPORT_DFLASH    
#endif // !BL_FEATURE_HAS_NO_INTERNAL_FLASH

    // Set default value size, may be modified below.
    uint32_t returnSize = sizeof(uint32_t);
    const void *returnValue;
    switch (tag)
    {
        case kPropertyTag_BootloaderVersion:
            returnValue = &propertyStore->bootloaderVersion.version;
            break;

        case kPropertyTag_AvailablePeripherals:
            returnValue = &propertyStore->availablePeripherals;
            break;

#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
        case kPropertyTag_FlashStartAddress:
            returnValue = &propertyStore->flashStartAddress[flashIndex];
            break;

        case kPropertyTag_FlashSizeInBytes:
            returnValue = &propertyStore->flashSizeInBytes[flashIndex];
            break;

        case kPropertyTag_FlashSectorSize:
            returnValue = &propertyStore->flashSectorSize[flashIndex];
            break;
        case kPropertyTag_FlashBlockCount:
            returnValue = &propertyStore->flashBlockCount[flashIndex];
            break;
#endif // !BL_FEATURE_HAS_NO_INTERNAL_FLASH

        case kPropertyTag_RAMStartAddress:
#if defined(KV58F24_SERIES) || defined(K28F15_SERIES) || defined(BL_FEATURE_MULTI_SRAM_SECTIONS)
            if (id >= kRAMCount)
            {
                returnValue = &propertyStore->ramStartAddress[0];
            }
            else
            {
                returnValue = &propertyStore->ramStartAddress[id];
            }
#else
            returnValue = &propertyStore->ramStartAddress[0];
#endif // #if defined(KV58F24_SERIES) || defined(K28F15_SERIES) || defined(BL_FEATURE_MULTI_SRAM_SECTIONS)
            break;

        case kPropertyTag_RAMSizeInBytes:
#if defined(KV58F24_SERIES) || defined(K28F15_SERIES) || defined(BL_FEATURE_MULTI_SRAM_SECTIONS)
            if (id >= kRAMCount)
            {
                returnValue = &propertyStore->ramSizeInBytes[0];
            }
            else
            {
                returnValue = &propertyStore->ramSizeInBytes[id];
            }
#else
            returnValue = &propertyStore->ramSizeInBytes[0];
#endif // #if defined(KV58F24_SERIES) || defined(K28F15_SERIES) || defined(BL_FEATURE_MULTI_SRAM_SECTIONS)
            break;

        case kPropertyTag_AvailableCommands:
            returnValue = &propertyStore->availableCommands;
            break;

#if BL_FEATURE_CRC_CHECK
        case kPropertyTag_CrcCheckStatus:
            returnValue = &propertyStore->crcCheckStatus;
            break;
#endif // else falls through to unknown
#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
        case kPropertyTag_VerifyWrites:
            returnValue = &propertyStore->verifyWrites;
            break;
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
        case kPropertyTag_MaxPacketSize:
            // Read the max packet size from the active peripheral.
            s_propertyReturnValue = g_bootloaderContext.activePeripheral->packetInterface->getMaxPacketSize(
                g_bootloaderContext.activePeripheral);
            returnValue = &s_propertyReturnValue;
            break;

        case kPropertyTag_ReservedRegions:
            returnSize = sizeof(propertyStore->reservedRegions);
            returnValue = propertyStore->reservedRegions;
            break;
#if !FSL_FEATURE_SIM_HAS_NO_SDID && defined(SIM)
        case kPropertyTag_SystemDeviceId:
            s_propertyReturnValue = SIM->SDID;
            returnValue = &s_propertyReturnValue;
            break;
#endif // #if !FSL_FEATURE_SIM_HAS_NO_SDID

#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
        case kPropertyTag_FlashSecurityState:
        {
            // Note: Both Main and Secondary flash share the same security state
            //  So it doesn't matter what index of allFlashState[] we use for this FLASH API.
            ftfx_security_state_t securityState;
            g_bootloaderContext.flashDriverInterface->flash_get_security_state(
                g_bootloaderContext.allFlashState, &securityState);
            s_propertyReturnValue = (securityState != kFTFx_SecurityStateNotSecure);
            returnValue = &s_propertyReturnValue;
            break;
        }
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH

#if !FSL_FEATURE_SIM_HAS_NO_UID
        case kPropertyTag_UniqueDeviceId:
            returnSize = sizeof(propertyStore->UniqueDeviceId);
            returnValue = &propertyStore->UniqueDeviceId;
            break;
#endif // #if !FSL_FEATURE_SIM_HAS_NO_UID

#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
        case kPropertyTag_FacSupport:
            returnSize = sizeof(propertyStore->flashFacSupport[flashIndex]);
            returnValue = &propertyStore->flashFacSupport[flashIndex];
            break;

        case kPropertyTag_FlashAccessSegmentSize:
            returnSize = sizeof(propertyStore->flashAccessSegmentSize[flashIndex]);
            returnValue = &propertyStore->flashAccessSegmentSize[flashIndex];
            break;

        case kPropertyTag_FlashAccessSegmentCount:
            returnSize = sizeof(propertyStore->flashAccessSegmentCount[flashIndex]);
            returnValue = &propertyStore->flashAccessSegmentCount[flashIndex];
            break;

        case kPropertyTag_FlashReadMargin:
            // Note: Currently both Main and Secondary flash share the same flash read margin
            returnSize = sizeof(propertyStore->flashReadMargin);
            returnValue = &propertyStore->flashReadMargin;
            break;
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH

#if BL_FEATURE_QSPI_MODULE
        case kPropertyTag_QspiInitStatus:
            returnValue = &propertyStore->qspiInitStatus;
            break;
#endif // else falls through to unknown

